{
    "fullName": "Julian Lopez Macia",
    "homeTown": "Alicante",
    "age": 21,
    "almaMater": "Universidad de Alicante",
    "mother": "Inmaculada Macia",
    "father": "Julian Lopez",
    "subjects": [
        {
            "name" : "Data Visualization",
            "teachers" : ["Jorge Acosta", "Pablo Toharia", "Antonio Latorre"],
            "brief description" : "Data visualization is the graphical representation of information and data. By using visual elements like charts, graphs, and maps, data visualization tools provide an accessible way to see and understand trends, outliers, and patterns in data."
        },
        {
            "name" : "Data Processes",
            "teachers" : ["Antonio Jesus Diaz", "Luis Mengual", "Maria Covadonga", "Ernestina Menasalvas", "Alejandro Rodriguez"],
            "brief description" : "Data processing is, generally, 'the collection and manipulation of items of data to produce meaningful information.' In this sense it can be considered a subset of information processing, 'the change (processing) of information in any manner detectable by an observer.'"
        },
        {
            "name" : "Big Data",
            "teachers" : ["Julian Arenas", "Jorge Acosta", "Antonio Latorre"],
            "brief description" : "Big data is a field that treats ways to analyze, systematically extract information from, or otherwise deal with data sets that are too large or complex to be dealt with by traditional data-processing application software."
        },
        {
            "name" : "Statistical Data Analysis",
            "teachers" : ["Maria Isabel Rodriguez", "Juan Antonio Fdez", "Antonio Jimenez", "Jacinto Gonzalez", "Arminda Moreno"],
            "brief description" : "Statistical data analysis is a procedure of performing various statistical operations. It is a kind of quantitative research, which seeks to quantify the data, and typically, applies some form of statistical analysis."
        },
        {
            "name" : "Intelligent Systems",
            "teachers" : ["Martin Molina", "M. Carmen Suarez", "Asuncion De Maria", "Daniel Manrique", "Mariano Rico", "Victor Rodriguez"],
            "brief description" : "An intelligent system is a machine with an embedded, Internet-connected computer that has the capacity to gather and analyze data and communicate with other systems. Other criteria for intelligent systems include the capacity to learn from experience, security, connectivity, the ability to adapt according to current data and the capacity for remote monitoring and management."
        },
        {
            "name" : "Open Data and Knowledge Graphs",
            "teachers" : ["Oscar Corcho", "Raul Garcia"],
            "brief description" : "Open data is the idea that some data should be freely available to everyone to use and republish as they wish, without restrictions from copyright, patents or other mechanisms of control."
        },
        {
            "name" : "Cloud Computing and Big Data Ecosystems",
            "teachers" : ["Marta Patiño", "Ainhoa Azqueta", "Tonghong Li "],
            "brief description" : "Cloud computing is the on-demand availability of computer system resources, especially data storage (cloud storage) and computing power, without direct active management by the user."
        },
        {
            "name" : "Machine Learning",
            "teachers" : ["Pedro Maria Larrañaga", "Maria Concepcion Bielza"],
            "brief description" : "Machine learning is an application of artificial intelligence (AI) that provides systems the ability to automatically learn and improve from experience without being explicitly programmed."
        }
    ]
}