
## Asignment 3

## 1. Get all the properties that 
    can be applied to instances of 
    the Politician class

## We put the distinct so are no duplicates
SELECT DISTINCT ?property
WHERE {
  ?politician a <http://dbpedia.org/ontology/Politician> .
  ?politician ?property ?value .
}


## Result

https://es.dbpedia.org/sparql?default-graph-uri=&query=SELECT+distinct+%3Fproperty%0D%0AWHERE+%7B%0D%0A++%3Fpolitician+a+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E+.%0D%0A++%3Fpolitician+%3Fproperty+%3Fvalue+.%0D%0A%7D%0D%0A&should-sponge=&format=text%2Fhtml&timeout=0&run=+Run+Query+

## 2. Get all the properties, 
      except rdf:type, that 
      can be applied to instances 
      of the Politician class


SELECT distinct ?property
WHERE {
  ?politician a <http://dbpedia.org/ontology/Politician> .
  ?politician ?property ?value .
  FILTER(?property != rdf:type)
}

## Result
https://es.dbpedia.org/sparql?default-graph-uri=&query=SELECT+distinct+%3Fproperty%0D%0AWHERE+%7B%0D%0A++%3Fpolitician+a+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E+.%0D%0A++%3Fpolitician+%3Fproperty+%3Fvalue+.%0D%0AFILTER%28%3Fproperty+%21%3D+rdf%3Atype%29%0D%0A%7D%0D%0A&should-sponge=&format=text%2Fhtml&timeout=0&run=+Run+Query+


## 3. Which different values exist 
      for the properties, except rdf:type,
      of the instances of the Politician class?


SELECT distinct ?value
WHERE {
  ?politician a <http://dbpedia.org/ontology/Politician> .
  ?politician ?property ?value .
  FILTER(?property != rdf:type)
}

## Result 
https://es.dbpedia.org/sparql?default-graph-uri=&query=SELECT+distinct+%3Fvalue%0D%0AWHERE+%7B%0D%0A++%3Fpolitician+a+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E+.%0D%0A++%3Fpolitician+%3Fproperty+%3Fvalue+.%0D%0A++FILTER%28%3Fproperty+%21%3D+rdf%3Atype%29%0D%0A%7D&should-sponge=&format=text%2Fhtml&timeout=0&run=+Run+Query+

## 4. For each of the properties 
      except rdf:type, that can 
      be applied to instances of 
      the Politician class, which 
      different values do they 
      take in those instances?

SELECT distinct ?property ?value
WHERE {
  ?politician a <http://dbpedia.org/ontology/Politician> .
  ?politician ?property ?value .
  FILTER(?property != rdf:type)
}

## Result 

https://es.dbpedia.org/sparql?default-graph-uri=&query=SELECT+distinct+%3Fproperty+%3Fvalue%0D%0AWHERE+%7B%0D%0A++%3Fpolitician+a+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E+.%0D%0A++%3Fpolitician+%3Fproperty+%3Fvalue+.%0D%0A++FILTER%28%3Fproperty+%21%3D+rdf%3Atype%29%0D%0A%7D&should-sponge=&format=text%2Fhtml&timeout=0&run=+Run+Query+

## 5. For each of the properties, except rdf:type, 
      that can be applied to instances of the Politician 
      class, how many distinct values do they take in those instances?

SELECT ?property (COUNT(DISTINCT ?value) AS ?count)
WHERE {
  ?politician a <http://dbpedia.org/ontology/Politician> .
  ?politician ?property ?value .
  FILTER(?property != rdf:type)
}
GROUP BY ?property

## Result

https://es.dbpedia.org/sparql?default-graph-uri=&query=SELECT+%3Fproperty+%28COUNT%28DISTINCT+%3Fvalue%29+AS+%3Fcount%29%0D%0AWHERE+%7B%0D%0A++%3Fpolitician+a+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E+.%0D%0A++%3Fpolitician+%3Fproperty+%3Fvalue+.%0D%0A++FILTER%28%3Fproperty+%21%3D+rdf%3Atype%29%0D%0A%7D%0D%0AGROUP+BY+%3Fproperty%0D%0A&should-sponge=&format=text%2Fhtml&timeout=0&run=+Run+Query+